In [46]:
# Import pandas library for data manipulation and analysis
import pandas as pd
# Import numpy library for numerical operations
import numpy as np
# Read CSV file from the specified path into a pandas DataFrame
df = pd.read_csv('/Users/rohankondhalkar/Desktop/Pandas/weatherNegative.csv')
# Display the DataFrame contents
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017       -99999          7  Sunny
2  1/3/2017           28     -99999   Snow
3  1/4/2017       -99999          7      0
4  1/5/2017           32     -99999   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      0

In [47]:
# Replace all instances of -99999 with NaN (Not a Number) values in the dataframe
# This is a common technique to handle missing or placeholder values
new_df = df.replace(-99999,np.nan)
# Display the new dataframe with NaN values instead of -99999
new_df

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/2/2017          NaN        7.0  Sunny
2  1/3/2017         28.0        NaN   Snow
3  1/4/2017          NaN        7.0      0
4  1/5/2017         32.0        NaN   Rain
5  1/6/2017         31.0        2.0  Sunny
6  1/6/2017         34.0        5.0      0

In [22]:
type('0')

str

In [48]:
# Create a new DataFrame by replacing specific values in the original DataFrame:
# - Replace -99999 with NaN (missing values)
# - Replace the string '0' with 'Sunny'
new_df = df.replace({
    -99999:np.nan,
    '0':'Sunny'
})
new_df  # Display the new DataFrame with replaced values

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/2/2017          NaN        7.0  Sunny
2  1/3/2017         28.0        NaN   Snow
3  1/4/2017          NaN        7.0  Sunny
4  1/5/2017         32.0        NaN   Rain
5  1/6/2017         31.0        2.0  Sunny
6  1/6/2017         34.0        5.0  Sunny

In [49]:
# Replace any alphabetic characters in 'temperature' and 'windspeed' columns with spaces
# This helps clean the data by removing text that might be mixed with numeric values
# The regex=True parameter enables regular expression pattern matching
new_df = new_df.replace({
    'temperature': '[A-Za-z]',  # Match any uppercase or lowercase letters in temperature column
    'windspeed': '[A-Za-z]',    # Match any uppercase or lowercase letters in windspeed column
}," ",regex = True)
new_df

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/2/2017          NaN        7.0  Sunny
2  1/3/2017         28.0        NaN   Snow
3  1/4/2017          NaN        7.0  Sunny
4  1/5/2017         32.0        NaN   Rain
5  1/6/2017         31.0        2.0  Sunny
6  1/6/2017         34.0        5.0  Sunny

In [38]:
# Import pandas library for data manipulation and analysis
import pandas as pd

# Create a DataFrame with two columns: 'score' and 'student'
# The DataFrame contains evaluation scores for 5 students
df = pd.DataFrame({
    'score': ['exceptional', 'average', 'poor', 'average', 'exceptional'],
    'student': ['rob', 'maya', 'parthiv', 'julian', 'erica']
})

# Display the DataFrame
df

         score  student
0  exceptional      rob
1      average     maya
2         poor  parthiv
3      average   julian
4  exceptional    erica

In [39]:
# Replace categorical values with numerical values for easier analysis
# 'poor' -> 1, 'average' -> 2, 'good' -> 3, 'exceptional' -> 4
new_df = df.replace(['poor', 'average', 'good', 'exceptional'], [1,2,3,4])
new_df  # Display the transformed dataframe with numerical values

/var/folders/vj/7_46kpps7m72d58fbpclz8b40000gn/T/ipykernel_40478/1820875856.py:3: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  new_df = df.replace(['poor', 'average', 'good', 'exceptional'], [1,2,3,4])

   score  student
0      4      rob
1      2     maya
2      1  parthiv
3      2   julian
4      4    erica

In [41]:
# Convert categorical score values to numerical values
# Map text ratings to a 1-4 scale:
# - 'poor' → 1
# - 'average' → 2
# - 'good' → 3
# - 'exceptional' → 4
df['score'] = df['score'].map({
    'poor': 1,
    'average': 2,
    'good': 3,
    'exceptional': 4
})

# Display the dataframe with the updated score column
df

   score  student
0    NaN      rob
1    NaN     maya
2    NaN  parthiv
3    NaN   julian
4    NaN    erica

In [42]:
new_df

   score  student
0      4      rob
1      2     maya
2      1  parthiv
3      2   julian
4      4    erica